fireFoam/testBatteryFireFOAM/wallFireSpread2D_MULES/0/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    region0_to_panelRegion_panel
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  solidThermo; //lookup; 
        emissivity      uniform 1.0;
        value           uniform 0;
    }

    ".*"
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  lookup; //solidThermo
        emissivity      uniform 1.0;
        value           uniform 0;
    }
}

// ************************************************************************* //
