fireFoam/testBatteryFireFOAM/wallFireSpread2D_MULES/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//active          false; //true;
active          true;

//surfaceFilmModel thermoSingleLayerFM;
surfaceFilmModel none;

filmRegionName  wallFilmRegion;

noneCoeffs{
    thermoModel constant;
}
kinematicSingleLayerCoeffs
{
    thermoModel constant;
    rho0        rho0 [1 -3 0 0 0] 1000;
    mu0         mu0 [1 -1 -1 0 0] 1e-3;
    sigma0      sigma0 [1 0 -2 0 0] 0.07;

    deltaStable deltaStable [0 1 0 0 0] 0;
    Cf          0.005;

    injectionModel none;
}

thermoSingleLayerCoeffs
{
    thermoModel singleComponent; // constant
//    thermoModel constant; // constant
    liquid      H2O;

    deltaStable deltaStable [0 1 0 0 0] 0;
    Cf          0.005;
    htcw        htcw [1 0 -3 -1 0] 1e3; // 0.0;
    htcs        htcs [1 0 -3 -1 0] 1e-8; // 0.0;

    rho0         rho [1 -3 0 0 0] 1000;
    mu0          mu [1 -1 -1 0 0] 1e-3;
    sigma0       sigma [1 0 -2 0 0] 0.07;
    cp0          cp [0 2 -2 -1 0] 4187;
    kappa0      kappa0 [1 1 -3 -1 0] 0.6;

    injectionModel none;

    phaseChangeModel standardPhaseChange; // only option currently available
    //phaseChangeModel none; // only option currently available
    standardPhaseChangeCoeffs
    {
        Tb               374.8;
        deltaMin         1e-8; // mass transfer turned off when film thickness below this value
        L                1; // length scale used in mean Nusselt and Sherwood correlation
    }

    upperSurfaceModels
    {
        //heatTransferModel mappedConvectiveHeatTransfer;  // gets htc from gas-phase calculation
        heatTransferModel constant;  // submodels/thermo/heatTransferModel/constantHeatTransfer/constantHeatTransfer.C
        constantCoeffs
        {
            c0                1000;
        }
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;  // submodels/thermo/heatTransferModel/constantHeatTransfer/constantHeatTransfer.C
        constantCoeffs
        {
            c0                50;
//            c0                1000;
        }
    }
    
}


thermoSingleLayerFMCoeffs
{
    thermoModel singleComponent; // constant
//    thermoModel constant; // constant
    liquid      H2O;

    deltaStable deltaStable [0 1 0 0 0] 0;
    Cf          0.005;
    htcw        htcw [1 0 -3 -1 0] 1e3; // 0.0;
    htcs        htcs [1 0 -3 -1 0] 1e-8; // 0.0;

    rho0         rho [1 -3 0 0 0] 1000;
    mu0          mu [1 -1 -1 0 0] 1e-3;
    sigma0       sigma [1 0 -2 0 0] 0.07;
    cp0          cp [0 2 -2 -1 0] 4187;
    kappa0      kappa0 [1 1 -3 -1 0] 0.6;

    qRadConstant qRadConstant [0 0 0 0 0] 0;
    //size of window used in Jaaps single-panel radiative experiment
    qRadXMax qRadXMax [0 1 0 0 0] 0.65; // this number estimated from photograph
    qRadXMin qRadXMin [0 1 0 0 0] 0.24;  //
    //qRadYMax qRadYMax [0 1 0 0 0] 0.51;
    //qRadYMin qRadYMin [0 1 0 0 0] 0.0;
    qRadYMax qRadYMax [0 1 0 0 0] 0.485;
    qRadYMin qRadYMin [0 1 0 0 0] 0.025;
    qRadBegin qRadBegin [0 0 1 0 0] 4;
    qRadEnd qRadEnd     [0 0 1 0 0] 32;

    deltaStable deltaStable [0 1 0 0 0] 0;
    Cf          0.005;
    contactAngleMean          75;
    contactAngleStdDev        10;
    contactAngleMax           100;
    contactAngleMin           50;
    contactAngleCoefficient          50.00;
    criticalFilmThickness   criticalFilmThickness [ 0 1 0 0 0 ] 0.00020;

    injectionModel none;

    phaseChangeModel standardPhaseChange; // only option currently available
    //phaseChangeModel none; // only option currently available
    standardPhaseChangeCoeffs
    {
        Tb               374.8;
        deltaMin         1e-8; // mass transfer turned off when film thickness below this value
        L                1; // length scale used in mean Nusselt and Sherwood correlation
    }

    upperSurfaceModels
    {
        //heatTransferModel mappedConvectiveHeatTransfer;  // gets htc from gas-phase calculation
        heatTransferModel constant;  // submodels/thermo/heatTransferModel/constantHeatTransfer/constantHeatTransfer.C
        constantCoeffs
        {
            c0                1000;
        }
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;  // submodels/thermo/heatTransferModel/constantHeatTransfer/constantHeatTransfer.C
        constantCoeffs
        {
            c0                1;
//            c0                1000;
        }
    }
    
}


